hiperiondev/esp32idf_APRS/components/webconfig/pages/page_radio.c
    char result[320];
    bool ok = aprs_tx_test_run(result, sizeof(result));

    // The message is assembled from fixed prose and the station's own
    // settings, so it carries nothing received off the air - but the quote and
    // backslash escapes are still applied, since it is rendered straight into
    // a JSON string.
    httpd_resp_sendstr_chunk(req, ok ? "{\"ok\":true,\"msg\":\"" : "{\"ok\":false,\"msg\":\"");

    char esc[128];
    size_t o = 0;
    for (size_t i = 0; result[i] != 0; i++) {
        unsigned char c = (unsigned char)result[i];
        if (o + 2 > sizeof(esc) - 1) {
            esc[o] = 0;
            httpd_resp_sendstr_chunk(req, esc);
            o = 0;
        }
        if (c == '"' || c == '\\') {
            esc[o++] = '\\';
            esc[o++] = (char)c;
        } else if (c < 0x20) {
            continue;
        } else {
            esc[o++] = (char)c;
        }
    }
    esc[o] = 0;
    httpd_resp_sendstr_chunk(req, esc);

    httpd_resp_sendstr_chunk(req, "\"}");
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
}

esp_err_t page_radio_post(httpd_req_t *req) {
    if (!web_check_auth(req))
        return ESP_OK;
    char body[1200];
    if (web_read_body(req, body, sizeof(body)) < 0) {
        httpd_resp_send_500(req);
        return ESP_OK;
    }

    // These two are parsed here and stored below, inside app_config_lock(),
    // together with the rest of the form: every write to g_config on this page
    // happens under the lock, so the whole page lands as one update as far as
    // any concurrent reader is concerned.
    // fx25Mode selects 0=off, 1=RX only, 2=RX+TX - clamp defensively since
    // Ax25Init() only defines behavior for 0-2, same reasoning as afskModem
    // below.
    int fx25_mode_in = web_form_get_int(body, "fx25Mode", g_config.fx25_mode);
    if (fx25_mode_in < 0)
        fx25_mode_in = 0;
    else if (fx25_mode_in > 2)
        fx25_mode_in = 2;
    bool audio_modem_en_in = web_form_get_bool(body, "audioModemEn");

    // afskModem selects the AFSK software modem modulation (300/1200/1200 V.23/9600 Bd)
    // used for both RX and TX on the audio ADC/DAC modem - clamp defensively since
    // modem_mode_t only defines values 0-3 (AFSK300/BELL202/V23/G3RUH).
    int afsk_modem_in = web_form_get_int(body, "afskModem", g_config.afsk_modem_type);
    if (afsk_modem_in < 0)
        afsk_modem_in = 0;
    else if (afsk_modem_in > 3)
        afsk_modem_in = 3;
    app_config_lock();
    g_config.fx25_mode = (uint8_t)fx25_mode_in;
    g_config.audio_modem_en = audio_modem_en_in;
    g_config.afsk_modem_type = (uint8_t)afsk_modem_in;
    // rfSql / rfVolume / adcAtten / agcMaxGain are not posted by the form
    // (see the read-only note in page_radio_get()); there are no g_config
    // fields behind them. The compiled-in values are displayed read-only.
    g_config.audio_lpf = web_form_get_bool(body, "audioLPF");
    // rfPTT (PTT GPIO) and rfPTTAct (PTT active-high) are not posted by the
    // form: both are fixed at compile time (MODEM_PTT_GPIO and
    // MODEM_PTT_ACTIVE_HIGH) and can't be changed from here.
    // TXDelay/preamble length (RF_PREAMBLE_MS_MIN..RF_PREAMBLE_MS_MAX ms,
    // default 300) - clamp defensively, same reasoning as afskModem above,
    // because an out-of-range value from a malformed POST should never be
    // stored. Nothing downstream would catch it either:
    // aprs_service_build_modem_config() copies this straight into the modem
    // configuration and Ax25TxDelay() turns it into a flag-byte count, so at
    // 1200 Bd an unclamped 65535 would put roughly a minute of continuous
    // carrier ahead of every single frame - a station that holds a shared VHF
    // APRS channel open indefinitely. Bounds come from aprs_service.h so the
    // form's min/max, this clamp and the flash-load clamp cannot drift apart.
    int preamble_in = web_form_get_int(body, "rfPreamble", g_config.preamble);
    if (preamble_in < RF_PREAMBLE_MS_MIN)
        preamble_in = RF_PREAMBLE_MS_MIN;
    else if (preamble_in > RF_PREAMBLE_MS_MAX)
        preamble_in = RF_PREAMBLE_MS_MAX;
    g_config.preamble = (uint16_t)preamble_in;

    // CSMA slot time (RF_TX_TIMESLOT_MS_MIN..RF_TX_TIMESLOT_MS_MAX ms,
    // default 2000) - clamp defensively, same reasoning as rfPreamble above.
    // This is how long the modem waits before rolling the p-persistence dice
    // again on a busy channel, so an out-of-range value stalls this station's
    // own transmissions rather than the channel's.
    int tx_timeslot_in = web_form_get_int(body, "txTimeSlot", g_config.tx_timeslot);
    if (tx_timeslot_in < RF_TX_TIMESLOT_MS_MIN)
        tx_timeslot_in = RF_TX_TIMESLOT_MS_MIN;
    else if (tx_timeslot_in > RF_TX_TIMESLOT_MS_MAX)
        tx_timeslot_in = RF_TX_TIMESLOT_MS_MAX;
    g_config.tx_timeslot = (uint16_t)tx_timeslot_in;

    // RF TX ring backlog limit (RF_TX_BUFFERS_MIN..RF_TX_BUFFERS_MAX frames,
    // default 1) - clamp defensively, same as afskModem above, since this
    // drives an array-free bound check in aprs_service_send_tnc2() rather
    // than an array index, but an out-of-range value from a malformed POST
    // should still never be stored. Bounds come from aprs_service.h so this
    // can never drift from the TX ring's real usable depth (see the comment
    // there on AX25_TX_FRAME_RING_MAX).
    int rf_tx_buffers_in = web_form_get_int(body, "rfTxBuffers", g_config.rf_tx_buffers);
    if (rf_tx_buffers_in < RF_TX_BUFFERS_MIN)
        rf_tx_buffers_in = RF_TX_BUFFERS_MIN;
    else if (rf_tx_buffers_in > RF_TX_BUFFERS_MAX)
        rf_tx_buffers_in = RF_TX_BUFFERS_MAX;
    g_config.rf_tx_buffers = (uint8_t)rf_tx_buffers_in;

    // Long-term TX duty-cycle ceiling (DUTY_CYCLE_PCT_MIN..DUTY_CYCLE_PCT_MAX,
    // default 25, enforced only while dutyCycleEn is on) - clamp defensively
    // against a malformed POST, same reasoning as rf_tx_buffers above. See
    // g_config.duty_cycle_en/duty_cycle_pct and the accumulator in
    // aprs_service.c for how this is enforced.
    g_config.duty_cycle_en = web_form_get_bool(body, "dutyCycleEn");
    int duty_cycle_pct_in = web_form_get_int(body, "dutyCyclePct", g_config.duty_cycle_pct);
    if (duty_cycle_pct_in < DUTY_CYCLE_PCT_MIN)
        duty_cycle_pct_in = DUTY_CYCLE_PCT_MIN;
    else if (duty_cycle_pct_in > DUTY_CYCLE_PCT_MAX)
        duty_cycle_pct_in = DUTY_CYCLE_PCT_MAX;
    g_config.duty_cycle_pct = (uint8_t)duty_cycle_pct_in;

